﻿﻿﻿﻿﻿//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************

//*************************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//*************************************************************************
//<AMI_FHDR_START>
//
// Name:	SB.UNI
//
// Description:	South Bridge setup string definitions 
//
//<AMI_FHDR_END>
//*************************************************************************

/=#
#include "VFR.uni"

#langdef   x-AMI "AmiMappingLanguage"           // AMI Mapping Language


#string STR_SB_PORTING_CONFIGURATION_FORM     #language eng "SB Porting Configuration"
#string STR_SB_PORTING_CONFIGURATION_HELP     #language eng "SB Porting Configuration."
#string STR_SB_PORTING_FORM_FORM_TITLE        #language eng "SB Porting Configuration"
#string STR_PCH_USB_CON_DISCON_WAKEUP_PROMPT  #language eng "EHCI Connect/Disconnect Wake Up"
                                              #language x-AMI "SB001"

#string STR_SATA_ROM_PROMPT                   #language eng "SATA RAID ROM"
                                              #language x-AMI "SB002"
#string STR_SATA_ROM_HELP                     #language eng "Legacy ROM: Legacy option ROM\nUEFI Driver: UEFI Raid Driver\nBoth: Run the legacy Option ROM and UEFI driver"
#string STR_SATA_LEGACYROM                    #language eng "Legacy ROM"
#string STR_SATA_UEFIRAID                     #language eng "UEFI Driver"
#string STR_SATA_BOTH                         #language eng "Both"

#string STR_EXTRA_OPTIONS_FORM_TITLE          #language eng "Extra options "
#string STR_EXTRA_OPTIONS_FORM_HELP           #language eng "PCI Express Root Port extra options."

#string STR_PCIE_NON_COMPLIANCE_PROMPT        #language eng "Detect Non-Compliance Device"
                                              #language x-AMI "SB003"
#string STR_PCIE_NON_COMPLIANCE_PROMPT1       #language eng "Detect Non-Compliance Device"
                                              #language x-AMI "SB007"
#string STR_PCIE_NON_COMPLIANCE_PROMPT2       #language eng "Detect Non-Compliance Device"
                                              #language x-AMI "SB008"
#string STR_PCIE_NON_COMPLIANCE_PROMPT3       #language eng "Detect Non-Compliance Device"
                                              #language x-AMI "SB009"
#string STR_PCIE_NON_COMPLIANCE_PROMPT4       #language eng "Detect Non-Compliance Device"
                                              #language x-AMI "SB00A"
#string STR_PCIE_NON_COMPLIANCE_PROMPT5       #language eng "Detect Non-Compliance Device"
                                              #language x-AMI "SB00B"
#string STR_PCIE_NON_COMPLIANCE_PROMPT6       #language eng "Detect Non-Compliance Device"
                                              #language x-AMI "SB00C"
#string STR_PCIE_NON_COMPLIANCE_PROMPT7       #language eng "Detect Non-Compliance Device"
                                              #language x-AMI "SB00D"
#string STR_PCIE_NON_COMPLIANCE_PROMPT8       #language eng "Detect Non-Compliance Device"
                                              #language x-AMI "SB00E"
#string STR_PCIE_NON_COMPLIANCE_PROMPT9       #language eng "Detect Non-Compliance Device"
                                              #language x-AMI "SB00F"
#string STR_PCIE_NON_COMPLIANCE_PROMPT10      #language eng "Detect Non-Compliance Device"
                                              #language x-AMI "SB00G"
#string STR_PCIE_NON_COMPLIANCE_PROMPT11      #language eng "Detect Non-Compliance Device"
                                              #language x-AMI "SB00H"
#string STR_PCIE_NON_COMPLIANCE_PROMPT12      #language eng "Detect Non-Compliance Device"
                                              #language x-AMI "SB00I"
#string STR_PCIE_NON_COMPLIANCE_PROMPT13      #language eng "Detect Non-Compliance Device"
                                              #language x-AMI "SB00J"
#string STR_PCIE_NON_COMPLIANCE_PROMPT14      #language eng "Detect Non-Compliance Device"
                                              #language x-AMI "SB00K"
#string STR_PCIE_NON_COMPLIANCE_PROMPT15      #language eng "Detect Non-Compliance Device"
                                              #language x-AMI "SB00L"
#string STR_PCIE_NON_COMPLIANCE_PROMPT16      #language eng "Detect Non-Compliance Device"
                                              #language x-AMI "SB00M"
#string STR_PCIE_NON_COMPLIANCE_PROMPT17      #language eng "Detect Non-Compliance Device"
                                              #language x-AMI "SB00N"
#string STR_PCIE_NON_COMPLIANCE_PROMPT18      #language eng "Detect Non-Compliance Device"
                                              #language x-AMI "SB00O"
#string STR_PCIE_NON_COMPLIANCE_PROMPT19      #language eng "Detect Non-Compliance Device"
                                              #language x-AMI "SB00P"
#string STR_PCIE_NON_COMPLIANCE_PROMPT20      #language eng "Detect Non-Compliance Device"
                                              #language x-AMI "SB00Q"
#string STR_PCIE_NON_COMPLIANCE_PROMPT21      #language eng "Detect Non-Compliance Device"
                                              #language x-AMI "SB00R"
#string STR_PCIE_NON_COMPLIANCE_PROMPT22      #language eng "Detect Non-Compliance Device"
                                              #language x-AMI "SB00S"
#string STR_PCIE_NON_COMPLIANCE_PROMPT23      #language eng "Detect Non-Compliance Device"                                            
                                              #language x-AMI "SB00T"
#string STR_PCIE_NON_COMPLIANCE_HELP          #language eng "Detect Non-Compliance PCI Express Device. If enable, it will take more time at POST time."
#string STR_COMMON_ENABLED                    #language eng "Enabled"
#string STR_COMMON_DISABLED                   #language eng "Disabled"

#string STR_PCIE_PF_RMEM_PROMPT               #language eng "Prefetchable Memory"
                                              #language x-AMI "SB004"
#string STR_PCIE_PF_RMEM_PROMPT1              #language eng "Prefetchable Memory"
                                              #language x-AMI "SB00U"
#string STR_PCIE_PF_RMEM_PROMPT2              #language eng "Prefetchable Memory"
                                              #language x-AMI "SB00V"
#string STR_PCIE_PF_RMEM_PROMPT3              #language eng "Prefetchable Memory"
                                              #language x-AMI "SB00W"
#string STR_PCIE_PF_RMEM_PROMPT4              #language eng "Prefetchable Memory"
                                              #language x-AMI "SB00X"
#string STR_PCIE_PF_RMEM_PROMPT5              #language eng "Prefetchable Memory"
                                              #language x-AMI "SB00Y"
#string STR_PCIE_PF_RMEM_PROMPT6              #language eng "Prefetchable Memory"
                                              #language x-AMI "SB00Z"
#string STR_PCIE_PF_RMEM_PROMPT7              #language eng "Prefetchable Memory"
                                              #language x-AMI "SB010"
#string STR_PCIE_PF_RMEM_PROMPT8              #language eng "Prefetchable Memory"
                                              #language x-AMI "SB011"
#string STR_PCIE_PF_RMEM_PROMPT9              #language eng "Prefetchable Memory"
                                              #language x-AMI "SB012"
#string STR_PCIE_PF_RMEM_PROMPT10             #language eng "Prefetchable Memory"
                                              #language x-AMI "SB013"
#string STR_PCIE_PF_RMEM_PROMPT11             #language eng "Prefetchable Memory"
                                              #language x-AMI "SB014"
#string STR_PCIE_PF_RMEM_PROMPT12             #language eng "Prefetchable Memory"
                                              #language x-AMI "SB015"
#string STR_PCIE_PF_RMEM_PROMPT13             #language eng "Prefetchable Memory"
                                              #language x-AMI "SB016"
#string STR_PCIE_PF_RMEM_PROMPT14             #language eng "Prefetchable Memory"
                                              #language x-AMI "SB017"
#string STR_PCIE_PF_RMEM_PROMPT15             #language eng "Prefetchable Memory"
                                              #language x-AMI "SB018"
#string STR_PCIE_PF_RMEM_PROMPT16             #language eng "Prefetchable Memory"
                                              #language x-AMI "SB019"
#string STR_PCIE_PF_RMEM_PROMPT17             #language eng "Prefetchable Memory"
                                              #language x-AMI "SB01A"
#string STR_PCIE_PF_RMEM_PROMPT18             #language eng "Prefetchable Memory"
                                              #language x-AMI "SB01B"
#string STR_PCIE_PF_RMEM_PROMPT19             #language eng "Prefetchable Memory"
                                              #language x-AMI "SB01C"
#string STR_PCIE_PF_RMEM_PROMPT20             #language eng "Prefetchable Memory"
                                              #language x-AMI "SB01D"
#string STR_PCIE_PF_RMEM_PROMPT21             #language eng "Prefetchable Memory"
                                              #language x-AMI "SB01E"
#string STR_PCIE_PF_RMEM_PROMPT22             #language eng "Prefetchable Memory"
                                              #language x-AMI "SB01F"
#string STR_PCIE_PF_RMEM_PROMPT23             #language eng "Prefetchable Memory"
                                              #language x-AMI "SB01G"
#string STR_PCIE_PF_RMEM_HELP                 #language eng "Prefetchable Memory Range for this Root Bridge."

#string STR_PCIE_RMEM_ALIG_PROMPT             #language eng "Reseved Memory Alignment"
                                              #language x-AMI "SB005"
#string STR_PCIE_RMEM_ALIG_PROMPT1            #language eng "Reseved Memory Alignment"
                                              #language x-AMI "SB01H"
#string STR_PCIE_RMEM_ALIG_PROMPT2            #language eng "Reseved Memory Alignment"
                                              #language x-AMI "SB01I"
#string STR_PCIE_RMEM_ALIG_PROMPT3            #language eng "Reseved Memory Alignment"
                                              #language x-AMI "SB01J"
#string STR_PCIE_RMEM_ALIG_PROMPT4            #language eng "Reseved Memory Alignment"
                                              #language x-AMI "SB01K"
#string STR_PCIE_RMEM_ALIG_PROMPT5            #language eng "Reseved Memory Alignment"
                                              #language x-AMI "SB01L"
#string STR_PCIE_RMEM_ALIG_PROMPT6            #language eng "Reseved Memory Alignment"
                                              #language x-AMI "SB01M"
#string STR_PCIE_RMEM_ALIG_PROMPT7            #language eng "Reseved Memory Alignment"
                                              #language x-AMI "SB01N"
#string STR_PCIE_RMEM_ALIG_PROMPT8            #language eng "Reseved Memory Alignment"
                                              #language x-AMI "SB01O"
#string STR_PCIE_RMEM_ALIG_PROMPT9            #language eng "Reseved Memory Alignment"
                                              #language x-AMI "SB01P"
#string STR_PCIE_RMEM_ALIG_PROMPT10           #language eng "Reseved Memory Alignment"
                                              #language x-AMI "SB01Q"
#string STR_PCIE_RMEM_ALIG_PROMPT11           #language eng "Reseved Memory Alignment"
                                              #language x-AMI "SB01R"
#string STR_PCIE_RMEM_ALIG_PROMPT12           #language eng "Reseved Memory Alignment"
                                              #language x-AMI "SB01S"
#string STR_PCIE_RMEM_ALIG_PROMPT13           #language eng "Reseved Memory Alignment"
                                              #language x-AMI "SB01T"
#string STR_PCIE_RMEM_ALIG_PROMPT14           #language eng "Reseved Memory Alignment"
                                              #language x-AMI "SB01U"
#string STR_PCIE_RMEM_ALIG_PROMPT15           #language eng "Reseved Memory Alignment"
                                              #language x-AMI "SB01V"
#string STR_PCIE_RMEM_ALIG_PROMPT16           #language eng "Reseved Memory Alignment"
                                              #language x-AMI "SB01W"
#string STR_PCIE_RMEM_ALIG_PROMPT17           #language eng "Reseved Memory Alignment"
                                              #language x-AMI "SB01X"
#string STR_PCIE_RMEM_ALIG_PROMPT18           #language eng "Reseved Memory Alignment"
                                              #language x-AMI "SB01Y"
#string STR_PCIE_RMEM_ALIG_PROMPT19           #language eng "Reseved Memory Alignment"
                                              #language x-AMI "SB01Z"
#string STR_PCIE_RMEM_ALIG_PROMPT20           #language eng "Reseved Memory Alignment"
                                              #language x-AMI "SB020"
#string STR_PCIE_RMEM_ALIG_PROMPT21           #language eng "Reseved Memory Alignment"
                                              #language x-AMI "SB021"
#string STR_PCIE_RMEM_ALIG_PROMPT22           #language eng "Reseved Memory Alignment"
                                              #language x-AMI "SB022"
#string STR_PCIE_RMEM_ALIG_PROMPT23           #language eng "Reseved Memory Alignment"
                                              #language x-AMI "SB023"
#string STR_PCIE_RMEM_ALIG_HELP               #language eng "Reseved Memory Alignment (0 - 31 bits)"

#string STR_PCIE_PF_RMEM_ALIG_PROMPT          #language eng "Prefetchable Memory Alignment"
                                              #language x-AMI "SB006"
#string STR_PCIE_PF_RMEM_ALIG_PROMPT1         #language eng "Prefetchable Memory Alignment"
                                              #language x-AMI "SB024"
#string STR_PCIE_PF_RMEM_ALIG_PROMPT2         #language eng "Prefetchable Memory Alignment"
                                              #language x-AMI "SB025"
#string STR_PCIE_PF_RMEM_ALIG_PROMPT3         #language eng "Prefetchable Memory Alignment"
                                              #language x-AMI "SB026"
#string STR_PCIE_PF_RMEM_ALIG_PROMPT4         #language eng "Prefetchable Memory Alignment"
                                              #language x-AMI "SB027"
#string STR_PCIE_PF_RMEM_ALIG_PROMPT5         #language eng "Prefetchable Memory Alignment"
                                              #language x-AMI "SB028"
#string STR_PCIE_PF_RMEM_ALIG_PROMPT6         #language eng "Prefetchable Memory Alignment"
                                              #language x-AMI "SB029"
#string STR_PCIE_PF_RMEM_ALIG_PROMPT7         #language eng "Prefetchable Memory Alignment"
                                              #language x-AMI "SB02A"
#string STR_PCIE_PF_RMEM_ALIG_PROMPT8         #language eng "Prefetchable Memory Alignment"
                                              #language x-AMI "SB02B"
#string STR_PCIE_PF_RMEM_ALIG_PROMPT9         #language eng "Prefetchable Memory Alignment"
                                              #language x-AMI "SB02C"
#string STR_PCIE_PF_RMEM_ALIG_PROMPT10        #language eng "Prefetchable Memory Alignment"
                                              #language x-AMI "SB02D"
#string STR_PCIE_PF_RMEM_ALIG_PROMPT11        #language eng "Prefetchable Memory Alignment"
                                              #language x-AMI "SB02E"
#string STR_PCIE_PF_RMEM_ALIG_PROMPT12        #language eng "Prefetchable Memory Alignment"
                                              #language x-AMI "SB02F"
#string STR_PCIE_PF_RMEM_ALIG_PROMPT13        #language eng "Prefetchable Memory Alignment"
                                              #language x-AMI "SB02G"
#string STR_PCIE_PF_RMEM_ALIG_PROMPT14        #language eng "Prefetchable Memory Alignment"
                                              #language x-AMI "SB02H"
#string STR_PCIE_PF_RMEM_ALIG_PROMPT15        #language eng "Prefetchable Memory Alignment"
                                              #language x-AMI "SB02I"
#string STR_PCIE_PF_RMEM_ALIG_PROMPT16        #language eng "Prefetchable Memory Alignment"
                                              #language x-AMI "SB02J"
#string STR_PCIE_PF_RMEM_ALIG_PROMPT17        #language eng "Prefetchable Memory Alignment"
                                              #language x-AMI "SB02K"
#string STR_PCIE_PF_RMEM_ALIG_PROMPT18        #language eng "Prefetchable Memory Alignment"
                                              #language x-AMI "SB02L"
#string STR_PCIE_PF_RMEM_ALIG_PROMPT19        #language eng "Prefetchable Memory Alignment"
                                              #language x-AMI "SB02M"
#string STR_PCIE_PF_RMEM_ALIG_PROMPT20        #language eng "Prefetchable Memory Alignment"
                                              #language x-AMI "SB02N"
#string STR_PCIE_PF_RMEM_ALIG_PROMPT21        #language eng "Prefetchable Memory Alignment"
                                              #language x-AMI "SB02O"
#string STR_PCIE_PF_RMEM_ALIG_PROMPT22        #language eng "Prefetchable Memory Alignment"
                                              #language x-AMI "SB02P"
#string STR_PCIE_PF_RMEM_ALIG_PROMPT23        #language eng "Prefetchable Memory Alignment"                                            
                                              #language x-AMI "SB02Q"
#string STR_PCIE_PF_RMEM_ALIG_HELP            #language eng "Prefetchable Memory Alignment (0 - 31 bits)"

//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************